public class Main {
    public static void main(String[] args) {
        //Задание 1
        System.out.println(" Задание 1");
        int age = 18;
        if (age >= 18) {
            System.out.println( " Поздравляем Вас с совершеннолетием!");
        }
        if (age < 18) {
            System.out.println( " Возраст совешеннолетия еще не наступил, Вам нужно немного подождать!");}

    }
}